{
  "desc.effect.async": "Concurrent execution increases SPD.",
  "desc.effect.bug_infested": "Bug infested, drains HP after each action. Ignores shields.",
  "desc.effect.cached": "Stores repeated data, boosting DEF.",
  "desc.effect.deadlocked": "Deadlocked, can not take actions.",
  "desc.effect.io_failure": "IO Failures reduces SPD.",
  "desc.effect.null_pointer": "Null reference error lowers ATK.",
  "desc.effect.optimize": "Code optimization increases ATK.",
  "desc.effect.overflowed": "Memory overflow reduces DEF.",
  "desc.effect.refactoring": "Refactoring the class, restores HP after each turn.",
  "desc.skill.arraycopy": "Perform an array copy. Lightly consumes your HP, then creates a shield lasts for 3 turns based on your MAXHP for a teammate. Has no effect when your HP is insufficient for consuming.",
  "desc.skill.forEach": "Iterates a single entity multiple times, deals small damage.",
  "desc.skill.gc": "Lightly heals a single allies and remove all their debuff effects.",
  "desc.skill.getProperty": "Gets the property of a single entity, deals small damage and recovers yourself a percentage of the damage dealt.",
  "desc.skill.hashCode": "Calculate the hashCode() of the arena. Deals random damage.",
  "desc.skill.next": "Seeks the next element. Bullseye; Greatly increases SPD until the next action.",
  "desc.skill.notify": "Notifies a single entity, deals small damage.",
  "desc.skill.remove": "Remove the element. Reduces the DEF of target for few turns.",
  "desc.skill.wait": "Wait for a turn, greatly increase ATK on the next action.",
  "dialogue.name.lawrence": "Lawrence",
  "dialogue.name.mark": "Mark",
  "dialogue.name.natalie": "Natalie",
  "dialogue.name.object": "Object",
  "dialogue.name.unknown": "???",
  "dialogue.text.home_001": "The train chugged to a station near your apartment building on the outdated edge of the city.",
  "dialogue.text.home_002": "The doors hissed open, and it released you as if spitting out a useless piece of code waiting to be recycled.",
  "dialogue.text.home_003": "You reach your apartment complex, standing in front of the door that's never felt more isolating.",
  "dialogue.text.home_004": "Your reflection in the glass door feels like an unfamiliar version of yourself, a null value in the context of the world.",
  "dialogue.text.home_005": "The place where you live, eat, and sleep — yet it seems so foreign now.",
  "dialogue.text.home_006": "You swipe your keycard, and the door clicks open with a soft hiss.",
  "dialogue.text.home_007": "The apartment is empty, cold.",
  "dialogue.text.home_008": "The hum of your computer is the only sound as you step inside, but even that feels distant.",
  "dialogue.text.home_009": "You drop your jacket on the couch and sit down at your desk.",
  "dialogue.text.home_010": "The screen in front of you flickers to life, offering the familiar IDE — one of the few things that hasn't changed, that hasn't been taken from you.",
  "dialogue.text.home_011": "The last piece of code that was not committed before being forcibly logged out still remained on it.",
  "dialogue.text.home_012": "Your fingers hover above the keys, trembling slightly. The \"exit\" code still lingers in your mind, replaying every moment of Lawrence's words.",
  "dialogue.text.home_013": "But as you stare at the blinking cursor, something inside you snaps.",
  "dialogue.text.home_014": "For a moment, nothing happens, but the circular progress indicator rotates.",
  "dialogue.text.home_015": "The room seems to grow stiller.",
  "dialogue.text.home_016": "Then, a sudden shift.",
  "dialogue.text.home_017": "The terminal begins to pulse, expanding into a cascade of symbols and code — an endless matrix unfolding before your eyes.",
  "dialogue.text.home_018": "Your apartment walls seem to melt away, the very reality around you warping into fragments of syntax.",
  "dialogue.text.home_019": "The code grows larger, surrounding you in a digital cocoon.",
  "dialogue.text.home_020": "You feel yourself falling, but there’s no sensation of gravity.",
  "dialogue.text.home_021": "No body, no space. Only the flow of pure data around you — an overwhelming rush of endless lines of code, each command a path leading to something.",
  "dialogue.text.home_022": "The very fabric of your world has dissolved into a quantum stream of logic and mathematical equations.",
  "dialogue.text.home_023": "Welcome to the Grid, Ada Null.",
  "dialogue.text.home_024": "Your execution has begun.",
  "dialogue.text.main_event01_001": "Suddenly, you are no longer falling.",
  "dialogue.text.main_event01_002": "You're standing on solid ground — or at least, what passes for solid ground in this programming world.",
  "dialogue.text.main_event01_003": "The world around you seems to shift in patterns, constantly evolving: abstract structures of variables, functions, and references stretch into infinity.",
  "dialogue.text.main_event01_004": "The sky above is a swirling vortex of code, the ground beneath your feet a patchwork of algorithmic fragments.",
  "dialogue.text.main_event01_005": "Floating in front of you is a Class — a humanoid figure, but its edges are made up of shifting lines of syntax and brackets.",
  "dialogue.text.main_event01_006": "It doesn't have a face, but you can sense its presence.",
  "dialogue.text.main_event01_007": "Click a row to move to it.\nYou can interact with the events/NPCs within a ±1 range.\n\nNow, try to move to line 4 to interact with the Object.",
  "dialogue.text.main_object_001": "I am Object. You are a Null. An undefined process.",
  "dialogue.text.main_object_002": "But not for long. You've been chosen to rewrite your own runtime.",
  "dialogue.text.main_object_003": "To debug the errors in this world.",
  "dialogue.text.main_object_004": "What is this place?",
  "dialogue.text.main_object_005": "This is the Code Grid — the foundation of all digital reality.",
  "dialogue.text.main_object_006": "It is where logic lives, where code is born. But something is broken. ",
  "dialogue.text.main_object_007": "Errors have spread throughout the layers, corrupting the system.",
  "dialogue.text.main_object_008": "You must restore what was lost.",
  "dialogue.text.main_object_009": "How do I fix the errors?",
  "dialogue.text.main_object_010": "To fix the system, you must travel through the Code Layers — Syntax, Logic, Memory, and Network.",
  "dialogue.text.main_object_011": "Each layer holds its own corruption, its own bugs.",
  "dialogue.text.main_object_012": "You must debug the broken classes and reclaim the lost references.",
  "dialogue.text.main_object_013": "Why was I chosen?",
  "dialogue.text.main_object_014": "You were chosen because of what you are. A Null, a void.",
  "dialogue.text.main_object_015": "You represent the broken state of the system, but also the potential to fix it.",
  "dialogue.text.main_object_016": "It is only through imperfection that we find the path to perfection.",
  "dialogue.text.main_object_017": "With Object's guidance, you step forward into the unknown, knowing that this is no longer just a world of code.",
  "dialogue.text.main_object_018": "This is your world now. A place where you must confront your deepest fears — the fear of being erased, of being null.",
  "dialogue.text.main_object_019": "The world stabilizes around you in slow, deliberate steps.",
  "dialogue.text.main_object_020": "What you stand on is not ground in the human sense, but allocated memory — wide planes of faintly glowing tiles, each engraved with symbols that shift when you look too closely.",
  "dialogue.text.main_object_021": "Above you, the sky is a deep gradient of indigo and black, threaded with luminous strands — threads, you realize.",
  "dialogue.text.main_object_022": "Some flow smoothly like rivers of light. Others flicker, pause, resume. A few abruptly terminate mid-air.",
  "dialogue.text.main_object_023": "Object floats before you, its form now clearer: a towering, architectural figure, like a living blueprint. Brackets form its shoulders. Keywords drift around it like sigils.",
  "dialogue.text.main_object_024": "This realm reflects all software systems beneath the surface of your world.",
  "dialogue.text.main_object_025": "What you call physical law there is merely an implementation detail here.",
  "dialogue.text.main_object_026": "Memory is land.",
  "dialogue.text.main_object_027": "Flow is river.",
  "dialogue.text.main_object_028": "Threads are paths walked by intention.",
  "dialogue.text.main_object_029": "Classes are structures.",
  "dialogue.text.main_object_030": "Objects... are those who inhabit them.",
  "dialogue.text.main_object_031": "As if to demonstrate, a distant city of towering constructs becomes visible—rectangular silhouettes of Classes, each emitting a faint aura of responsibility.",
  "dialogue.text.main_object_032": "Smaller figures move in and out of them, instantiating, dissolving, returning.",
  "dialogue.text.main_object_033": "Then the light dims.",
  "dialogue.text.main_object_034": "Corruption is spreading through the Grid.",
  "dialogue.text.main_object_035": "Data rot.",
  "dialogue.text.main_object_036": "Logical breaks.",
  "dialogue.text.main_object_037": "Resource starvation.",
  "dialogue.text.main_object_038": "When flow breaks, time stutters.",
  "dialogue.text.main_object_039": "When logic fails... something else is born.",
  "dialogue.text.main_object_040": "From the fractured ground, a shape twitches—half-formed, unstable, as if unsure whether it exists.",
  "dialogue.text.main_object_041": "You feel something cold in your chest.",
  "dialogue.text.main_object_042": "Null.",
  "dialogue.text.main_object_043": "You look down at your hands.",
  "dialogue.text.main_object_044": "They are yours—but not entirely. Faint outlines of syntax shimmer beneath your skin. Your heartbeat feels like a clock cycle.",
  "dialogue.text.main_object_045": "I'm... instantiated.",
  "dialogue.text.main_object_046": "But without a default value.",
  "dialogue.text.main_object_047": "A familiar fear tightens around your thoughts—the fear of being unreferenced. Forgotten. Garbage-collected.",
  "dialogue.text.main_object_048": "Object turns toward you.",
  "dialogue.text.main_object_049": "You are not bound here by accident, Ada Null.",
  "dialogue.text.main_object_050": "Very few minds can cross the abstraction barrier.",
  "dialogue.text.main_object_051": "Only those who intuitively understand that code is not merely written — but inhabited.",
  "dialogue.text.main_object_052": "Images flash in your mind: Late nights. Distributed systems diagrams. Failure modes. Retry logic. Designing for chaos. For partial failure.",
  "dialogue.text.main_object_053": "You crossed over at the moment of collapse.",
  "dialogue.text.main_object_054": "When your world returned zero, but your process did not terminate.",
  "dialogue.text.main_object_055": "Object turns and points toward a narrow corridor cutting through the terrain.",
  "dialogue.text.main_object_056": "It is darker than the rest of the Grid — a winding trail where the light thins, where threads converge and then vanish. The air hums with unresolved references.",
  "dialogue.text.main_object_057": "This is the null_path.",
  "dialogue.text.main_object_058": "The path seems... unfinished.",
  "dialogue.text.main_object_059": "Sections of it flicker between existence and absence.",
  "dialogue.text.main_object_060": "It is taken by those who are undefined.",
  "dialogue.text.main_object_061": "It leads to a place that should not exist — yet does.",
  "dialogue.text.main_object_062": "In the distance, barely visible, is a plateau overlooking the Grid. A quiet place. Stable. Anchored.",
  "dialogue.text.main_object_063": "Your destination is null_view.",
  "dialogue.text.main_object_064": "A vantage point. A base context.",
  "dialogue.text.main_object_065": "From there, you will observe, refactor, and fight.",
  "dialogue.text.main_object_066": "...",
  "dialogue.text.main_object_067": "And if I fail on this path?",
  "dialogue.text.main_object_068": "Then you will become what you fear.",
  "dialogue.text.main_object_069": "Let's step onto this path now.",
  "dialogue.text.matrix_corp_001": "Location: Matrix Headquarters, Silica City",
  "dialogue.text.matrix_corp_002": "Time: 7:45 PM — one week before the \"Null Sequence.\"",
  "dialogue.text.matrix_corp_003": "The sharp, sterile atmosphere of the office is suffocating.",
  "dialogue.text.matrix_corp_004": "The usual hum of servers and flicker of monitors seem quieter today — a subtle, uncomfortable stillness fills the air.",
  "dialogue.text.matrix_corp_005": "You've spent years here, working with some of the brightest minds in tech.",
  "dialogue.text.matrix_corp_006": "And today... it feels like everything is about to break.",
  "dialogue.text.matrix_corp_007": "You walk through the halls — not yet knowing your fate — but the weight of the gossip, the sideways glances, and the too-sweet smiles tells you everything.",
  "dialogue.text.matrix_corp_008": "The company is cutting back.",
  "dialogue.text.matrix_corp_009": "And you might be next.",
  "dialogue.text.matrix_corp_010": "Natalie stands by the coffee machine, her face pale, eyes darting nervously from the clock to her phone.",
  "dialogue.text.matrix_corp_011": "She doesn't meet your gaze as you walk in.",
  "dialogue.text.matrix_corp_012": "Hey, Natalie. You alright?",
  "dialogue.text.matrix_corp_013": "(forced smile) Yeah... just...",
  "dialogue.text.matrix_corp_014": "just a little under the weather today, you know.",
  "dialogue.text.matrix_corp_015": "The grind, and all that.",
  "dialogue.text.matrix_corp_016": "Right. Just keep your head down, it'll pass. It always does.",
  "dialogue.text.matrix_corp_017": "I heard they're cutting some... positions today.",
  "dialogue.text.matrix_corp_018": "HR's been meeting with people all morning.",
  "dialogue.text.matrix_corp_019": "Not sure if you're in the clear... or... well, you know.",
  "dialogue.text.matrix_corp_020": "That's... unfortunate.",
  "dialogue.text.matrix_corp_021": "Natalie looks down at her coffee, steeling herself.",
  "dialogue.text.matrix_corp_022": "I guess you should prepare for the worst. Always best to be pragmatic.",
  "dialogue.text.matrix_corp_023": "(nervously laughs) Yeah, yeah... I mean, you won't get cut, right?",
  "dialogue.text.matrix_corp_024": "You're... a senior engineer. I heard the higher-ups depend on you.",
  "dialogue.text.matrix_corp_025": "(inwardly sighs, then offers a faint smile) We all depend on something, don't we? You'll be fine. Just stay focused.",
  "dialogue.text.matrix_corp_026": "Mark, the lead engineer, walks into the break room as you sip your coffee.",
  "dialogue.text.matrix_corp_027": "He stands tall, his arms crossed, the very image of confidence.",
  "dialogue.text.matrix_corp_028": "But his face is tight, anxious — you know something's coming.",
  "dialogue.text.matrix_corp_029": "He looks at you, then quickly glances away. The silence between you two feels heavier than usual.",
  "dialogue.text.matrix_corp_030": "Mark. You're looking... stressed.",
  "dialogue.text.matrix_corp_031": "(chuckles weakly) Can't hide anything from you, huh?",
  "dialogue.text.matrix_corp_032": "Yeah, I'm... a bit on edge. Management's been tight-lipped about things.",
  "dialogue.text.matrix_corp_033": "It's just economic pressure. Everyone's trimming the fat.",
  "dialogue.text.matrix_corp_034": "We've seen this coming for a while.",
  "dialogue.text.matrix_corp_035": "You're right... But that doesn't make it easier.",
  "dialogue.text.matrix_corp_036": "The office politics are... well, let's just say they've been shifting for a while.",
  "dialogue.text.matrix_corp_037": "Some people are making moves.",
  "dialogue.text.matrix_corp_038": "(eyes narrowing) I'm sure they are.",
  "dialogue.text.matrix_corp_039": "(voice turning quieter) You didn't get caught up in any of that, did you?",
  "dialogue.text.matrix_corp_040": "*sigh* It's hard not to. But no, I stayed out of the drama.",
  "dialogue.text.matrix_corp_041": "Still, no one's safe. There's a lot of talk about restructuring... and people being... let go.",
  "dialogue.text.matrix_corp_042": "Restructuring?",
  "dialogue.text.matrix_corp_043": "Who exactly is making the decisions?",
  "dialogue.text.matrix_corp_044": "Mark glances at the door, and lowers his voice",
  "dialogue.text.matrix_corp_045": "It's coming from the top. Lawrence.",
  "dialogue.text.matrix_corp_046": "He's... been pushing for more \"efficiency\" lately.",
  "dialogue.text.matrix_corp_047": "I'm not sure who exactly is being targeted, but if you don't fall under the ‘essential' category...",
  "dialogue.text.matrix_corp_048": "Well, you know the rest.",
  "dialogue.text.matrix_corp_049": "(clenching jaw, with mind racing) Yeah. I know.",
  "dialogue.text.matrix_corp_050": "You stand outside Lawrence's office, looking at the glass door with his name printed in bold, sleek letters.",
  "dialogue.text.matrix_corp_051": "You've been here before — countless times. Yet today, the door feels like a barrier between you and your future.",
  "dialogue.text.matrix_corp_052": "You take a deep breath and step inside.",
  "dialogue.text.matrix_corp_053": "(smiling, almost too broadly) Ah, Ada. Good to see you. Please, have a seat.",
  "dialogue.text.matrix_corp_054": "(gestures to the chair) I'm glad we could chat.",
  "dialogue.text.matrix_corp_055": "(sitting down, heart pounding) Of course. You wanted to see me?",
  "dialogue.text.matrix_corp_056": "(pauses, a shadow of discomfort in eyes) Yes, I... I won't beat around the bush, Ada.",
  "dialogue.text.matrix_corp_057": "I know you've been with us for a long time, and your contributions have been... invaluable.",
  "dialogue.text.matrix_corp_058": "(looks down, then back up at you) “But with the current economic downturn... and the need for us to streamline operations, we're forced to make some difficult decisions.",
  "dialogue.text.matrix_corp_059": "(calmly) Difficult decisions... like what?",
  "dialogue.text.matrix_corp_060": "We've had to assess team structures, project scopes, and efficiency.",
  "dialogue.text.matrix_corp_061": "Unfortunately... the reality is that your position...",
  "dialogue.text.matrix_corp_062": "as it currently stands...",
  "dialogue.text.matrix_corp_063": "is no longer viable.",
  "dialogue.text.matrix_corp_064": "(voice steady but controlled) You're letting me go.",
  "dialogue.text.matrix_corp_065": "Ada, I don't want to phrase it like that, but yes... we're going to have to part ways.",
  "dialogue.text.matrix_corp_066": "It's not about your performance, but rather... the need for restructuring.",
  "dialogue.text.matrix_corp_067": "(smiling thinly) Efficiency. Streamlining. The familiar terms.",
  "dialogue.text.matrix_corp_068": "(looking guilty) I really do wish it were different, Ada.",
  "dialogue.text.matrix_corp_069": "I value what you've done here.",
  "dialogue.text.matrix_corp_070": "But these decisions come from higher up. Corporate directives.",
  "dialogue.text.matrix_corp_071": "You lean forward slightly, your calm demeanor hiding the storm beneath.",
  "dialogue.text.matrix_corp_072": "And your directive is to discard those who don't fit the current \"model.\" The perfect exit, isn't it?",
  "dialogue.text.matrix_corp_073": "(avoids eye contact) Ada, I—",
  "dialogue.text.matrix_corp_074": "It's fine, Lawrence. I understand.",
  "dialogue.text.matrix_corp_075": "I'm just another variable in your optimization cycle.",
  "dialogue.text.matrix_corp_076": "(leans back, voice almost a whisper) But I'll find my own way to recompile.",
  "dialogue.text.matrix_corp_077": "As the conversation ends, you leave Lawrence's office, the reality of the layoff sinking in.",
  "dialogue.text.matrix_corp_078": "It was as abrupt as a fatal runtime exception, with no chance of being caught.",
  "dialogue.text.matrix_corp_079": "But this isn't the end. Not for you.",
  "dialogue.text.matrix_corp_080": "As you walk down the sleek, white corridors of Matrix, you feel the weight of every line of code you've ever written, every system you've helped design, every distributed process you've fine-tuned... slipping away.",
  "dialogue.text.matrix_corp_081": "There's a feeling that maybe you've been optimized out of the equation — but that doesn't mean you're done.",
  "dialogue.text.matrix_corp_082": "Your greatest fear, null, looms large.",
  "dialogue.text.matrix_corp_083": "The idea of being discarded, of being forgotten — erased from existence like a piece of code with no reference. It gnaws at you, deep in your chest.",
  "dialogue.text.matrix_corp_084": "But then, another thought surfaces:",
  "dialogue.text.matrix_corp_085": "Maybe this is the ultimate test. If I can't rely on the systems, I'll have to build my own.",
  "dialogue.text.matrix_corp_086": "And with that, a strange sense of clarity washes over you. This isn't the end. This is just the beginning.",
  "dialogue.text.matrix_corp_087": "The elevator hums as it descends from the 108th floor. It's excruciatingly silent.",
  "dialogue.text.matrix_corp_088": "Through the glass walls of the shaft, the skyline of Silica City flickers like a motherboard — towers lit by blue neon veins, data barges drifting through the fog.",
  "dialogue.text.matrix_corp_089": "You stand there with your badge still hanging from your neck:",
  "dialogue.text.matrix_corp_090": "MATRIX // Ada Null // Software Engineer II",
  "dialogue.text.matrix_corp_091": "The screen embedded in the badge flashes red.",
  "dialogue.text.matrix_corp_092": "SYSTEM NOTICE:\n\"Employment thread terminated. Return code: 0.\"",
  "dialogue.text.matrix_corp_093": "return 0;",
  "dialogue.text.matrix_corp_094": "A clean exit.",
  "dialogue.text.matrix_corp_095": "No errors, no warnings — just silence.",
  "dialogue.text.matrix_corp_096": "The weight of Lawrence's words still presses down on your chest.",
  "dialogue.text.matrix_corp_097": "It's an odd feeling, like you've been hollowed out.",
  "dialogue.text.matrix_corp_098": "You're not sure if the elevator is rising or falling, the verticality of Matrix's towering building distorting your sense of space.",
  "dialogue.text.matrix_corp_099": "You can almost hear the hum of the server farms, the algorithmic heartbeat of Matrix, fading as the elevator moves lower, deeper.",
  "dialogue.text.matrix_corp_100": "The doors open to the lobby — empty now, aside from a few scattered figures typing away on their smartphones, heads bent, lost in the glow of their screens.",
  "dialogue.text.matrix_corp_101": "The sleek reception desk is unmanned.",
  "dialogue.text.matrix_corp_102": "Their slogan used to be displayed on the reception desk and echoed on every floor:",
  "dialogue.text.matrix_corp_103": "\"Matrix — Connecting the Grids of the Digital Mind.\"",
  "dialogue.text.matrix_corp_104": "But this month, they changed it.",
  "dialogue.text.matrix_corp_105": "\"Matrix — Return 0. The Perfect Exit.\"",
  "dialogue.text.matrix_corp_106": "A joke for programmers, a curse for employees.",
  "dialogue.text.matrix_corp_107": "You step out, the cold of the night air hitting you as you pass through the glass doors and onto the street.",
  "dialogue.text.null_path_event01_001": "As you step onto the null_path, the world reacts.",
  "dialogue.text.null_path_event01_002": "The ambient noise of the Grid fades. The light dims. Threads above fracture into shadows.",
  "dialogue.text.null_path_event01_003": "Your system state appears before you — instinctively, like muscle memory.",
  "dialogue.text.null_path_event01_004": "Nullable... figures.",
  "dialogue.text.null_path_event01_005": "The ground ahead trembles.",
  "dialogue.text.null_path_event01_006": "Something crawls out of the corrupted terrain.",
  "dialogue.text.null_path_event01_007": "It is small, but deeply wrong.",
  "dialogue.text.null_path_event01_008": "A hunched, glitching creature, its body composed of broken pointers and dangling references.",
  "dialogue.text.null_path_event01_009": "Its limbs snap between positions, occasionally phasing through itself.",
  "dialogue.text.null_path_event01_010": "Where its face should be is a void that swallows light.",
  "dialogue.text.null_path_event01_011": "Nullptr.",
  "dialogue.text.null_path_event01_012": "A dereference without a check.",
  "dialogue.text.null_path_event01_013": "One of the most primitive manifestations of corruption.",
  "dialogue.text.null_path_event01_014": "The creature screeches — not a sound, but a runtime exception, echoing directly in your thoughts.",
  "dialogue.text.null_path_event01_015": "Exception in thread \"main\":\njava.lang.NullPointerException",
  "dialogue.text.null_path_event01_016": "I've seen this before.",
  "dialogue.text.null_path_event01_017": "Countless times.",
  "dialogue.text.null_path_event01_018": "It lunges.",
  "dialogue.text.null_path_event01_019": "Nullptr collapses inward, folding into a single dark point before vanishing.",
  "dialogue.text.null_path_event01_020": "The ground stabilizes. Silence returns.",
  "dialogue.text.null_path_event01_021": "So this is what my fear looks like.",
  "dialogue.text.null_path_event01_022": "You did not erase it. You handled it.",
  "dialogue.text.null_path_event01_023": "That distinction matters.",
  "dialogue.text.null_path_event01_024": "The path ahead brightens slightly. The end of the null_path is now clearly visible.",
  "dialogue.text.null_path_event01_025": "Null_view awaits — a quiet overlook where threads converge neatly, where memory feels… sufficient.",
  "dialogue.text.null_path_event01_026": "A place to stand.",
  "dialogue.text.null_path_event01_027": "A place to think.",
  "dialogue.text.null_path_event01_028": "A place to rebuild.",
  "dialogue.text.null_path_event01_029": "This will be your base context.",
  "dialogue.text.null_path_event01_030": "From here, your execution truly begins.",
  "dialogue.text.null_path_event01_031": "As you step forward, one thought lingers in your mind — not fear, but resolve.",
  "dialogue.text.null_path_event01_032": "If this world is built on rules…",
  "dialogue.text.null_path_event01_033": "then I can learn them.",
  "dialogue.text.null_path_event01_034": "And if something is broken —",
  "dialogue.text.null_path_event01_035": "I can fix it.",
  "dialogue.text.silica_city_001": "Location: 42nd Avenue, Silica City",
  "dialogue.text.silica_city_002": "Time: 8:15 PM — Evening",
  "dialogue.text.silica_city_003": "Silica City, once a place of possibilities, now feels like a massive, indifferent data center — endless lines of code wrapped around steel and concrete.",
  "dialogue.text.silica_city_004": "You walk briskly, your footsteps mixing with the hum of distant machines.",
  "dialogue.text.silica_city_005": "Your mind is quiet but turbulent, a perfect storm of calm calculation and uncertainty.",
  "dialogue.text.silica_city_006": "A woman passes you by, her umbrella casting an abstract, sharp silhouette in the neon light.",
  "dialogue.text.silica_city_007": "She looks familiar — someone from the office?",
  "dialogue.text.silica_city_008": "You can't tell. You don't recognize her anymore. You don't recognize anything anymore.",
  "dialogue.text.silica_city_009": "A figure stops in front of you, blocking your path to the railway station. You barely notice him until he speaks.",
  "dialogue.text.silica_city_010": "You look... lost. Or maybe found?",
  "dialogue.text.silica_city_011": "Hard to tell with the rain.",
  "dialogue.text.silica_city_012": "Sorry, I—",
  "dialogue.text.silica_city_013": "No need to apologize.",
  "dialogue.text.silica_city_014": "It's just, you seem like you're walking away from something important... or maybe something that's already been erased.",
  "dialogue.text.silica_city_015": "He looks at you with a strange mixture of understanding and amusement.",
  "dialogue.text.silica_city_016": "(frowning) Who are you?",
  "dialogue.text.silica_city_017": "(laughs lightly) I'm just another process running in the background.",
  "dialogue.text.silica_city_018": "You'll forget me soon enough. Everyone does.",
  "dialogue.text.silica_city_019": "But, here's a thought: when you get to the end of this loop, don't be afraid to change the parameters.",
  "dialogue.text.silica_city_020": "You might just find the real \"exit\".",
  "dialogue.text.silica_city_021": "The stranger turns, disappearing into the rainy night.",
  "dialogue.text.silica_city_022": "His words feel like a coded message, a hint at something deeper — something you don't understand yet, but somehow should.",
  "dialogue.text.silica_city_023": "The way back to your apartment is a blur.",
  "dialogue.text.silica_city_024": "The evening light in the city reflects off the rain, turning the streets into an iridescent maze of colors — blue for data streams, green for function calls, and red for errors."
}