{
  "desc.effect.async": "Concurrent execution increases SPD.",
  "desc.effect.bug_infested": "Bug infested, drains HP after each action. Ignores shields.",
  "desc.effect.cached": "Stores repeated data, boosting DEF.",
  "desc.effect.deadlocked": "Deadlocked, can not take actions.",
  "desc.effect.io_failure": "IO Failures reduces SPD.",
  "desc.effect.null_pointer": "Null reference error lowers ATK.",
  "desc.effect.optimize": "Code optimization increases ATK.",
  "desc.effect.overflowed": "Memory overflow reduces DEF.",
  "desc.effect.refactoring": "Refactoring the class, restores HP after each turn.",
  "desc.skill.arraycopy": "Perform an array copy. Lightly consumes your HP, then creates a shield lasts for 3 turns based on your MAXHP for a teammate. Has no effect when your HP is insufficient for consuming.",
  "desc.skill.forEach": "Iterates a single entity multiple times, deals small damage.",
  "desc.skill.gc": "Lightly heals a single allies and remove all their debuff effects.",
  "desc.skill.getProperty": "Gets the property of a single entity, deals small damage and recovers yourself a percentage of the damage dealt.",
  "desc.skill.hashCode": "Calculate the hashCode() of the arena. Deals random damage.",
  "desc.skill.next": "Seeks the next element. Bullseye; Greatly increases SPD until the next action.",
  "desc.skill.notify": "Notifies a single entity, deals small damage.",
  "desc.skill.remove": "Remove the element. Reduces the DEF of target for few turns.",
  "desc.skill.wait": "Wait for a turn, greatly increase ATK on the next action.",
  "dialogue.name.lawrence": "Lawrence",
  "dialogue.name.mark": "Mark",
  "dialogue.name.natalie": "Natalie",
  "dialogue.text.matrix_corp_001": "Location: Matrix Headquarters, Silica City",
  "dialogue.text.matrix_corp_002": "Time: 7:45 PM — one week before the \"Null Sequence.\"",
  "dialogue.text.matrix_corp_003": "The sharp, sterile atmosphere of the office is suffocating.",
  "dialogue.text.matrix_corp_004": "The usual hum of servers and flicker of monitors seem quieter today — a subtle, uncomfortable stillness fills the air.",
  "dialogue.text.matrix_corp_005": "You've spent years here, working with some of the brightest minds in tech.",
  "dialogue.text.matrix_corp_006": "And today... it feels like everything is about to break.",
  "dialogue.text.matrix_corp_007": "You walk through the halls — not yet knowing your fate — but the weight of the gossip, the sideways glances, and the too-sweet smiles tells you everything.",
  "dialogue.text.matrix_corp_008": "The company is cutting back.",
  "dialogue.text.matrix_corp_009": "And you might be next.",
  "dialogue.text.matrix_corp_010": "Natalie stands by the coffee machine, her face pale, eyes darting nervously from the clock to her phone.",
  "dialogue.text.matrix_corp_011": "She doesn't meet your gaze as you walk in.",
  "dialogue.text.matrix_corp_012": "Hey, Natalie. You alright?",
  "dialogue.text.matrix_corp_013": "(forced smile) Yeah... just...",
  "dialogue.text.matrix_corp_014": "just a little under the weather today, you know.",
  "dialogue.text.matrix_corp_015": "The grind, and all that.",
  "dialogue.text.matrix_corp_016": "Right. Just keep your head down, it'll pass. It always does.",
  "dialogue.text.matrix_corp_017": "I heard they're cutting some... positions today.",
  "dialogue.text.matrix_corp_018": "HR's been meeting with people all morning.",
  "dialogue.text.matrix_corp_019": "Not sure if you're in the clear... or... well, you know.",
  "dialogue.text.matrix_corp_020": "That's... unfortunate.",
  "dialogue.text.matrix_corp_021": "Natalie looks down at her coffee, steeling herself.",
  "dialogue.text.matrix_corp_022": "I guess you should prepare for the worst. Always best to be pragmatic.",
  "dialogue.text.matrix_corp_023": "(nervously laughs) Yeah, yeah... I mean, you won't get cut, right?",
  "dialogue.text.matrix_corp_024": "You're... a senior engineer. I heard the higher-ups depend on you.",
  "dialogue.text.matrix_corp_025": "(inwardly sighs, then offers a faint smile) We all depend on something, don't we? You'll be fine. Just stay focused.",
  "dialogue.text.matrix_corp_026": "Mark, the lead engineer, walks into the break room as you sip your coffee.",
  "dialogue.text.matrix_corp_027": "He stands tall, his arms crossed, the very image of confidence.",
  "dialogue.text.matrix_corp_028": "But his face is tight, anxious — you know something's coming.",
  "dialogue.text.matrix_corp_029": "He looks at you, then quickly glances away. The silence between you two feels heavier than usual.",
  "dialogue.text.matrix_corp_030": "Mark. You're looking... stressed.",
  "dialogue.text.matrix_corp_031": "(chuckles weakly) Can't hide anything from you, huh?",
  "dialogue.text.matrix_corp_032": "Yeah, I'm... a bit on edge. Management's been tight-lipped about things.",
  "dialogue.text.matrix_corp_033": "It's just economic pressure. Everyone's trimming the fat.",
  "dialogue.text.matrix_corp_034": "We've seen this coming for a while.",
  "dialogue.text.matrix_corp_035": "You're right... But that doesn't make it easier.",
  "dialogue.text.matrix_corp_036": "The office politics are... well, let's just say they've been shifting for a while.",
  "dialogue.text.matrix_corp_037": "Some people are making moves.",
  "dialogue.text.matrix_corp_038": "(eyes narrowing) I'm sure they are.",
  "dialogue.text.matrix_corp_039": "(voice turning quieter) You didn't get caught up in any of that, did you?",
  "dialogue.text.matrix_corp_040": "*sigh* It's hard not to. But no, I stayed out of the drama.",
  "dialogue.text.matrix_corp_041": "Still, no one's safe. There's a lot of talk about restructuring... and people being... let go.",
  "dialogue.text.matrix_corp_042": "Restructuring?",
  "dialogue.text.matrix_corp_043": "Who exactly is making the decisions?",
  "dialogue.text.matrix_corp_044": "Mark glances at the door, and lowers his voice",
  "dialogue.text.matrix_corp_045": "It's coming from the top. Lawrence.",
  "dialogue.text.matrix_corp_046": "He's... been pushing for more \"efficiency\" lately.",
  "dialogue.text.matrix_corp_047": "I'm not sure who exactly is being targeted, but if you don't fall under the ‘essential' category...",
  "dialogue.text.matrix_corp_048": "Well, you know the rest.",
  "dialogue.text.matrix_corp_049": "(clenching jaw, with mind racing) Yeah. I know.",
  "dialogue.text.matrix_corp_050": "You stand outside Lawrence's office, looking at the glass door with his name printed in bold, sleek letters.",
  "dialogue.text.matrix_corp_051": "You've been here before — countless times. Yet today, the door feels like a barrier between you and your future.",
  "dialogue.text.matrix_corp_052": "You take a deep breath and step inside.",
  "dialogue.text.matrix_corp_053": "(smiling, almost too broadly) Ah, Ada. Good to see you. Please, have a seat.",
  "dialogue.text.matrix_corp_054": "(gestures to the chair) I'm glad we could chat.",
  "dialogue.text.matrix_corp_055": "(sitting down, heart pounding) Of course. You wanted to see me?",
  "dialogue.text.matrix_corp_056": "(pauses, a shadow of discomfort in eyes) Yes, I... I won't beat around the bush, Ada.",
  "dialogue.text.matrix_corp_057": "I know you've been with us for a long time, and your contributions have been... invaluable.",
  "dialogue.text.matrix_corp_058": "(looks down, then back up at you) “But with the current economic downturn... and the need for us to streamline operations, we're forced to make some difficult decisions.",
  "dialogue.text.matrix_corp_059": "(calmly) Difficult decisions... like what?",
  "dialogue.text.matrix_corp_060": "We've had to assess team structures, project scopes, and efficiency.",
  "dialogue.text.matrix_corp_061": "Unfortunately... the reality is that your position...",
  "dialogue.text.matrix_corp_062": "as it currently stands...",
  "dialogue.text.matrix_corp_063": "is no longer viable.",
  "dialogue.text.matrix_corp_064": "(voice steady but controlled) You're letting me go.",
  "dialogue.text.matrix_corp_065": "Ada, I don't want to phrase it like that, but yes... we're going to have to part ways.",
  "dialogue.text.matrix_corp_066": "It's not about your performance, but rather... the need for restructuring.",
  "dialogue.text.matrix_corp_067": "(smiling thinly) Efficiency. Streamlining. The familiar terms.",
  "dialogue.text.matrix_corp_068": "(looking guilty) I really do wish it were different, Ada.",
  "dialogue.text.matrix_corp_069": "I value what you've done here.",
  "dialogue.text.matrix_corp_070": "But these decisions come from higher up. Corporate directives.",
  "dialogue.text.matrix_corp_071": "You lean forward slightly, your calm demeanor hiding the storm beneath.",
  "dialogue.text.matrix_corp_072": "And your directive is to discard those who don't fit the current \"model.\" The perfect exit, isn't it?",
  "dialogue.text.matrix_corp_073": "(avoids eye contact) Ada, I—",
  "dialogue.text.matrix_corp_074": "It's fine, Lawrence. I understand.",
  "dialogue.text.matrix_corp_075": "I'm just another variable in your optimization cycle.",
  "dialogue.text.matrix_corp_076": "(leans back, voice almost a whisper) But I'll find my own way to recompile.",
  "dialogue.text.matrix_corp_077": "As the conversation ends, you leave Lawrence's office, the reality of the layoff sinking in.",
  "dialogue.text.matrix_corp_078": "It was as abrupt as a fatal runtime exception, with no chance of being caught.",
  "dialogue.text.matrix_corp_079": "But this isn't the end. Not for you.",
  "dialogue.text.matrix_corp_080": "As you walk down the sleek, white corridors of Matrix, you feel the weight of every line of code you've ever written, every system you've helped design, every distributed process you've fine-tuned... slipping away.",
  "dialogue.text.matrix_corp_081": "There's a feeling that maybe you've been optimized out of the equation — but that doesn't mean you're done.",
  "dialogue.text.matrix_corp_082": "Your greatest fear, null, looms large.",
  "dialogue.text.matrix_corp_083": "The idea of being discarded, of being forgotten — erased from existence like a piece of code with no reference. It gnaws at you, deep in your chest.",
  "dialogue.text.matrix_corp_084": "But then, another thought surfaces:",
  "dialogue.text.matrix_corp_085": "Maybe this is the ultimate test. If I can't rely on the systems, I'll have to build my own.",
  "dialogue.text.matrix_corp_086": "And with that, a strange sense of clarity washes over you. This isn't the end. This is just the beginning.",
  "dialogue.text.matrix_corp_087": "The elevator hums as it descends from the 108th floor. It's excruciatingly silent.",
  "dialogue.text.matrix_corp_088": "Through the glass walls of the shaft, the skyline of Silica City flickers like a motherboard — towers lit by blue neon veins, data barges drifting through the fog.",
  "dialogue.text.matrix_corp_089": "You stand there with your badge still hanging from your neck:",
  "dialogue.text.matrix_corp_090": "MATRIX // Ada Null // Software Engineer II",
  "dialogue.text.matrix_corp_091": "The screen embedded in the badge flashes red.",
  "dialogue.text.matrix_corp_092": "SYSTEM NOTICE:\n\"Employment thread terminated. Return code: 0.\"",
  "dialogue.text.matrix_corp_093": "return 0;",
  "dialogue.text.matrix_corp_094": "A clean exit.",
  "dialogue.text.matrix_corp_095": "No errors, no warnings — just silence.",
  "dialogue.text.matrix_corp_096": "The weight of Lawrence's words still presses down on your chest.",
  "dialogue.text.matrix_corp_097": "It's an odd feeling, like you've been hollowed out.",
  "dialogue.text.matrix_corp_098": "You're not sure if the elevator is rising or falling, the verticality of Matrix's towering building distorting your sense of space.",
  "dialogue.text.matrix_corp_099": "You can almost hear the hum of the server farms, the algorithmic heartbeat of Matrix, fading as the elevator moves lower, deeper.",
  "dialogue.text.matrix_corp_100": "The doors open to the lobby — empty now, aside from a few scattered figures typing away on their smartphones, heads bent, lost in the glow of their screens.",
  "dialogue.text.matrix_corp_101": "The sleek reception desk is unmanned.",
  "dialogue.text.matrix_corp_102": "Their slogan used to be displayed on the reception desk and echoed on every floor:",
  "dialogue.text.matrix_corp_103": "\"Matrix — Connecting the Grids of the Digital Mind.\"",
  "dialogue.text.matrix_corp_104": "But this month, they changed it.",
  "dialogue.text.matrix_corp_105": "\"Matrix — Return 0. The Perfect Exit.\"",
  "dialogue.text.matrix_corp_106": "A joke for programmers, a curse for employees.",
  "dialogue.text.matrix_corp_107": "You step out, the cold of the night air hitting you as you pass through the glass doors and onto the street."
}